// src/constants/regionRaw.js

// 시/도 → 시/군/구 → 읍/면/동 → [도로명들]
export const RAW_REGION_DATA = {
  "강원도": {
    "양구군": {
      "국토정중앙면": ["죽리"]
    },
    "인제군": {
      "북면": ["원통리"],
      "남면": ["신남리"],
      "인제읍": ["기타"]
    },
    "정선군": {
      "남면": ["민둥산로"],
      "정선읍": ["애산로"],
      "화암면": ["그림바위길"]
    },
    "철원군": {
      "갈말읍": ["명성로", "명성로149번길"],
      "김화읍": ["청양로"],
      "동송읍": ["이평로123번길", "상노2길", "금학로"],
      "서면": ["와수로", "와수1로", "와수로166번길"],
      "철원읍": ["금학로251번안길"]
    },
    "속초시": {
      "교동": ["미시령로", "동해대로", "엑스포로"]
    },
    "태백시": {
      "소도동": ["소도길"]
    }
  },
  "경기도": {
    "가평군": {
      "가평읍": ["향교로"]
    },
    "고양시": {
      "덕양구": ["화정동"],
      "일산서구": ["주엽동"]
    },
    "부천시": {
      "오정동": ["성오로"],
      "원미구": ["심곡동"],
      "소사구": ["괴안동", "송내동"],
      "옥길동": ["양지로"]
    },
    "수원시": {
      "영통구": ["이의동"]
    },
    "시흥시": {
      "능곡동": ["승지로"],
      "대야동": ["대골안길"],
      "정왕동": ["정왕대로143번길", "배곧4로", "배곧1로", "정왕천로"]
    },
    "안산시": {
      "상록구": ["월피동"]
    },
    "안성시": {
      "미양면": ["구수리"],
      "서운면": ["바우덕이로"],
      "양성면": ["양성로"],
      "죽산면": ["죽산초교길"],
      "아양동": ["내혜홀3길"]
    },
    "여주시": {
      "가남읍": ["태평4길"],
      "점봉동": ["세종로"]
    },
    "이천시": {
      "갈산동": ["증신로"]
    },
    "의정부시": {
      "민락동": ["오목로"]
    },
    "화성시": {
      "동탄": ["동탄대로시범길"],
      "산척동": ["동탄산척로"]
    }
  },
  "광주광역시": {
    "광산구": {
      "도산동": ["송도로208번길"]
    },
    "남구": {
      "월산동": ["중앙로"],
      "기타": ["강서구"]
    },
    "서구": {
      "금호동": ["금화로115번길"]
    }
  },
  "대구광역시": {
    "달서구": {
      "이곡동": ["선원남로"],
      "신당동": ["계대동문로3길"],
      "장기동": ["장기로"]
    },
    "달성군": {
      "현풍읍": ["비슬로134길"],
      "화원읍": ["성암로"]
    },
    "동구": {
      "방촌동": ["동촌로42길"],
      "대성동": ["대전로"]
    },
    "서구": {
      "평리동": ["국채보상로37길"],
      "비산동": ["통학로217"]
    }
  },
  "대전광역시": {
    "대덕구": {
      "오정동": ["동산초교로63번길", "동산초교로 63번길"],
      "송강동": ["송갈오 42번길"]
    },
    "동구": {
      "가양동": ["우암로"],
      "대동": ["동대전로110번길"],
      "용전동": ["기타"],
      "대성동": ["대전로"]
    },
    "서구": {
      "갈마동": ["대덕대로112번길"],
      "관저동": ["관저동로", "관저로"],
      "괴정동": ["동서대로997번길"],
      "내동": ["동서대로1063번길"],
      "도마동": ["배재로46번길"],
      "변동": ["유등로", "동서대로 968"],
      "용문동": ["괴정로"],
      "기성동": ["기성초교길"]
    },
    "유성구": {
      "관평동": ["배울2로"],
      "노은동": ["노은동로"],
      "송강동": ["와룡로"],
      "기타": ["43"]
    },
    "중구": {
      "대흥동": ["대흥로"],
      "목동": ["동서대로", "동서대로 1368"],
      "문화동": ["문화로", "문화로 200", "문화로 183"],
      "석교동": ["대종로204번길"],
      "오류동": ["오류로"],
      "기타": ["수도산로", "솔밭로16번길"]
    }
  },
  "부산광역시": {
    "금정구": {
      "구서동": ["체육공원로"]
    },
    "동구": {
      "초량동": ["초량로40번길"]
    },
    "부산진구": {
      "초읍동": ["성지로94번길"]
    },
    "영등포구": {
      "당산동6가": ["양평로"]
    }
  },
  "서울특별시": {
    "금천구": {
      "독산동": ["독산로102길"]
    },
    "동작구": {
      "사당동": ["솔밭로"]
    },
    "영등포구": {
      "양평동5가": ["양평로21가길"],
      "신길동": ["신길로28길"]
    },
    "강남구": {
      "개포동": ["개포로"]
    },
    "기타": {
      "기타": ["ㅇㄴㄻㄴㅇㄹㅇㄴㅁㄹ"]
    }
  },
  "세종특별자치시": {
    "세종특별자치시": {
      "고운동": ["마음안1로"],
      "반곡동": ["시청대로"],
      "부강면": ["부강로"],
      "소정면": ["학교말길"],
      "연기면": ["연기길"],
      "연동면": ["청연로"],
      "조치원읍": ["향나무길"]
    }
  },
  "울산광역시": {
    "남구": {
      "삼산동": ["돋질로251번길"]
    },
    "동구": {
      "화정동": ["대송9길"]
    },
    "북구": {
      "천곡동": ["천곡남로"]
    },
    "울주군": {
      "삼남면": ["사촌신복로"],
      "상북면": ["상북로"],
      "언양읍": ["샘소3길", "북문8길", "북문13길"],
      "온산읍": ["덕망로", "신온9길"],
      "온양읍": ["화산발리로"]
    },
    "중구": {
      "다운동": ["다운8길"],
      "반구동": ["해오름1길"],
      "약사동": ["약사로"],
      "남외동": ["염포로"]
    }
  },
  "인천광역시": {
    "남동구": {
      "만수동": ["장승남로33번길"]
    },
    "부평구": {
      "부평동": ["경인로911번길"],
      "삼산동": ["영성로"],
      "십정동": ["경원대로"]
    }
  },
  "전라남도": {
    "강진군": {
      "강진읍": ["중앙로", "고성길"],
      "군동면": ["종합운동장길"],
      "도암면": ["봉황로"],
      "병영면": ["하멜로"]
    },
    "곡성군": {
      "고달면": ["곡고로"],
      "목사동면": ["주목로"],
      "삼기면": ["곡순로"],
      "옥과면": ["대학로"],
      "죽곡면": ["오죽로"]
    },
    "광양시": {
      "광양읍": ["와룡길", "숲샘길", "신재로"],
      "봉강면": ["매천로"],
      "중동": ["광장로"],
      "기타": ["용강1길"]
    },
    "나주시": {
      "노안면": ["노안로"],
      "남외동": ["남외1길"],
      "빛가람동": ["호수로"],
      "산포면": ["산포로"],
      "세지면": ["동창로"],
      "영강동": ["영강길"],
      "죽림동": ["남산길"],
      "이창동": ["이창1길"],
      "기타": ["대호길", "금천면"]
    },
    "무안군": {
      "망운면": ["망운로"],
      "삼향읍": ["남악4로82번길"]
    },
    "여수시": {
      "서교동": ["서교1길"]
    },
    "영광군": {
      "영광읍": ["중앙로", "월현로"]
    },
    "영암군": {
      "삼호읍": ["중앙촌길", "대불주거6로", "방아제로"],
      "신북면": ["간은정로"],
      "영암읍": ["여중고길", "영암초중고길"]
    },
    "장흥군": {
      "대덕읍": ["대대로"],
      "부산면": ["부유로"],
      "안양면": ["운정2길"],
      "장흥읍": ["칠거리예양로", "못골길", "의향길"],
      "회진면": ["가학회진로"]
    },
    "진도군": {
      "진도읍": ["성내길", "동외4길"]
    },
    "함평군": {
      "학교면": ["학교길"]
    },
    "신안군": {
      "압해읍": ["구항길"]
    }
  },
  "전라북도": {
    "고창군": {
      "고창읍": ["중앙로", "보릿골로", "중거리당산로"],
      "아산면": ["녹두로"],
      "신림면": ["동법지길"],
      "심원면": ["심원로"],
      "흥덕면": ["흥덕초등길"]
    },
    "군산시": {
      "경장동": ["경포천로"],
      "성산면": ["송호로"],
      "조촌동": ["번영로"]
    },
    "김제시": {
      "금산면": ["모악로"],
      "백구면": ["황토로"],
      "봉남면": ["남주1길"],
      "용지면": ["황토로 702"]
    },
    "남원시": {
      "도통동": ["동림로"],
      "동충동": ["용성로"],
      "이백면": ["이백로", "평촌길"],
      "인월면": ["인월1길", "인월장터로"],
      "향교동": ["광천남길"],
      "기타": ["대복사길", "만인로"]
    },
    "순창군": {
      "구림면": ["방화로"],
      "동계면": ["동계로"],
      "순창읍": ["순창7길", "담순로"]
    },
    "익산시": {
      "부송동": ["무왕로31길"],
      "신동": ["동서로19길"],
      "함열읍": ["와리3길"]
    },
    "장수군": {
      "계남면": ["조곡길"],
      "산서면": ["동백로"],
      "장수읍": ["호비로"]
    },
    "정읍시": {
      "시기동": ["남산5길"]
    },
    "완주군": {
      "삼례읍": ["후정로", "웃삼례길"]
    },
    "진안군": {
      "부귀면": ["상거석길"],
      "진안읍": ["중앙로", "우화2길", "학천변길"]
    }
  },
  "제주특별자치도": {
    "서귀포시": {
      "대정읍": ["상모대서로", "비행장로"],
      "서홍동": ["일주동로"],
      "성산읍": ["고성오조로"],
      "안덕면": ["화순로56번길"],
      "표선면": ["표선동서로", "표선중앙로"]
    },
    "제주시": {
      "건입동": ["동문로"],
      "구남동": ["구남동2길"],
      "삼도이동": ["중앙로8길"],
      "외도이동": ["일주서로"],
      "도련일동": ["화삼북로"],
      "오라동": ["연사길"]
    }
  },
  "충청남도": {
    "계룡시": {
      "금암동": ["장안로"],
      "두마면": ["팥거리로"],
      "엄사면": ["번영3길", "문화원1로"]
    },
    "당진시": {
      "대덕동": ["대덕로"]
    },
    "부여군": {
      "구룡면": ["성충로"]
    },
    "서산시": {
      "대산읍": ["충의로"],
      "동문동": ["중앙로", "서령로"],
      "석남동": ["덕지천로"],
      "읍내동": ["부춘2로", "양유정1로"],
      "해미면": ["남문2로"],
      "기타": ["안견로"]
    },
    "서천군": {
      "장항읍": ["성화로193번길"]
    },
    "아산시": {
      "용화동": ["시민로258번길"]
    },
    "예산군": {
      "예산읍": ["주교로", "예중길", "신례원로"]
    },
    "태안군": {
      "남면": ["남면로"],
      "소원면": ["서해로", "모항파도로"],
      "안면읍": ["꽃지해안로", "조운막터길", "황도로"],
      "이원면": ["원이로"],
      "태안읍": ["백화로", "다락미4길", "중앙로", "평천길"]
    },
    "청양군": {
      "정산면": ["칠갑산로"],
      "화성면": ["무한로"]
    }
  },
  "충청북도": {
    "옥천군": {
      "옥천읍": ["장야3길"]
    },
    "영동군": {
      "추풍령면": ["신안로"]
    },
    "제천시": {
      "명지동": ["강명길"],
      "봉양읍": ["팔송로"],
      "화산동": ["내토로41길"]
    },
    "청주시": {
      "청원구": ["2순환로", "2산단2로"]
    },
    "충주시": {
      "금가면": ["가마골길"],
      "금릉동": ["금봉대로"],
      "대림동": ["대림1길"],
      "목행동": ["목행초길"],
      "노은면": ["연하중앙길"],
      "안림동": ["안림로"]
    },
    "보은군": {
      "보은읍": ["성주길", "자영고길"]
    }
  },
  "경상남도": {
    "거제시": {
      "둔덕면": ["하둔3길"],
      "고현동": ["서문로1길"],
      "장평동": ["장평1로"]
    },
    "고성군": {
      "동해면": ["동해로"],
      "하이면": ["남일로"]
    },
    "산청군": {
      "산청읍": ["꽃봉산로79번길"]
    },
    "사천시": {
      "동금동": ["삼상로", "동금로"],
      "용강동": ["상강청길"]
    },
    "양산시": {
      "어곡동": ["두전길"],
      "소주동": ["백동길"]
    },
    "진주시": {
      "상봉동": ["의곡길"]
    },
    "창녕군": {
      "남지읍": ["낙동로"]
    },
    "하동군": {
      "옥종면": ["주포중앙길"],
      "적량면": ["금강길"],
      "하동읍": ["남당길", "송림1길"]
    }
  },
  "경상북도": {
    "경산시": {
      "사동": ["솔숲길"],
      "정평동": ["대학로16길"]
    },
    "경주시": {
      "노서동": ["원효로"],
      "안강읍": ["안강중앙로"],
      "기타": ["승삼2길"]
    },
    "봉화군": {
      "봉화읍": ["교촌1길"]
    },
    "상주시": {
      "공성면": ["문화마을길"],
      "모동면": ["덕곡1길"],
      "모서면": ["백화로"],
      "사벌면": ["덕담1길"],
      "화동면": ["이소1길"],
      "화서면": ["화령로"]
    },
    "안동시": {
      "옥동": ["옥서4길", "하이마로"],
      "태화동": ["서경지8길"]
    },
    "영주시": {
      "가흥동": ["신재로"],
      "상망동": ["의상로"],
      "하망동": ["이산로"],
      "휴천동": ["남간로25번길"]
    },
    "영양군": {
      "영양읍": ["군청길"]
    },
    "영천시": {
      "금노동": ["천문로"]
    },
    "의성군": {
      "봉양면": ["도리원5길"],
      "안계면": ["용기9길"],
      "의성읍": ["군청길"]
    },
    "에천군": {
      "예천읍": ["효자로43"]
    }
  }
};
